Revit 2027 API
NumericRevisionSettings.Prefix Property
 The prefix string that will be prepended to the number of each revision with Numeric RevisionNumberingType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Prefix { get; set; }
Public Property Prefix As String
	Get
	Set
public:
property String^ Prefix {
	String^ get ();
	void set (String^ value);
}
member Prefix : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
NumericRevisionSettings Class
Autodesk.Revit.DB Namespace